### DV1597 Exercise 3
Tobias Gustafsson
***

### 1. Provide answers

### Manhattan dataset

Where in Manhattan is the most/least expensive real estate located? What is the relationship between the sales price and gross square feet?

In [115]:
import pandas as pd

df = pd.read_excel('rollingsales_manhattan.xls', header=4)
df = df.iloc[:,[1,19]].dropna()

# print(df['NEIGHBORHOOD'].unique())
chelsea = df.loc[df['NEIGHBORHOOD'] == 'CHELSEA                  '].reset_index()
c2 = chelsea.iloc[:,2:].values
print(c2.mean())
print(c2.std())

chelsea

# df_grouped = df_2.groupby('NEIGHBORHOOD')
# std = df_grouped.std().reset_index()
# df_grouped = df_grouped.mean().reset_index().rename(columns={'SALE PRICE': 'AVERAGE SALE PRICE'})
# print(std)
# print(df_grouped)
# df_grouped.insert(0,2,std,True)

2993419.7604035307
9379724.59955534

     index               NEIGHBORHOOD  SALE PRICE
0      184  CHELSEA                      13000000
1      185  CHELSEA                             0
2      186  CHELSEA                             0
3      187  CHELSEA                       7425000
4      188  CHELSEA                             0
..     ...                        ...         ...
788    972  CHELSEA                       5100000
789    973  CHELSEA                       1750000
790    974  CHELSEA                      12250000
791    975  CHELSEA                             0
792    976  CHELSEA                             0

[793 rows x 3 columns]

### 2012 Olympics dataset

What can you say about the relationship between a country’s population and the number of medals it wins? What can you say about the relationship between the ratio of female and male counts and the GDP of that country?

In [21]:
df_ol = pd.read_csv('olympics.csv')
print(df_ol)

   ISO country code Country name      2011 GDP  2010 population  Female count  \
0               USA           US  1.509400e+13        309349000           271
1               CHN        China  7.298100e+12       1338300000           208
2               JPN        Japan  5.867150e+12        127451000           162
3               DEU      Germany  3.570560e+12         81777000           176
4               FRA       France  2.773030e+12         64895000           148
5               BRA       Brazil  2.476650e+12        194946000           128
6               GBR           UK  2.431590e+12         62232000           269
7               ITA        Italy  2.194750e+12         60483000           122
8               RUS       Russia  1.857770e+12        141750000           227
9               IND        India  1.847980e+12       1224615000            23
10              JAM      Jamaica  1.506977e+10          2702000            25
11              GEO      Georgia  1.436657e+10          4452000             6
12              PRK  North Korea  1.228000e+10         24589122            40
13              ARM      Armenia  1.024779e+10          3092000             4
14              MNG     Mongolia  8.557530e+09          2756000            13
15              BHS      Bahamas  7.787514e+09           343000            11
16              MDA      Moldova  7.000319e+09          3562000            10
17              TJK   Tajikistan  6.522200e+09          6879000             3
18              MNE   Montenegro  4.550463e+09           632000            16
19              GRD      Grenada  8.160541e+08           104000             4

    Male count  Gold medals  Silver medals  Bronze medals
0          260           46             29             29
1          163           38             27             23
2          141            7             14             17
3          219           11             19             14
4          187           11             11             12
5          138            3              5              9
6          287           29             17             19
7          159            8              9             11
8          208           24             26             32
9           60            0              2              4
10          25            4              4              4
11          29            1              3              3
12          15            4              0              2
13          21            0              1              2
14          16            0              2              3
15          15            1              0              0
16          12            0              0              2
17          13            0              0              1
18          18            0              1              0
19           6            1              0              0